Функция АктуальнаяЦенаРозница(АктуальнаяДата, СсылкаНоменклатура) Экспорт
	
	Цена = ПолучитьЦену(АктуальнаяДата, СсылкаНоменклатура, Перечисления.ТипыЦенНоменклатуры.Розница);
	
	Возврат Цена; 
КонецФункции

Функция АктуальнаяЦенаЗакупка(АктуальнаяДата, СсылкаНоменклатура) Экспорт
	
	Цена = ПолучитьЦену(АктуальнаяДата, СсылкаНоменклатура, Перечисления.ТипыЦенНоменклатуры.Закупка);
	
	Возврат Цена; 
КонецФункции

Функция ПолучитьЦену(Знач АктуальнаяДата, Знач СсылкаНоменклатура, Знач ТипЦеныНоменклатуры)
	
	Перем ЗначениеРесурсов, Отбор;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипыЦенНоменклатуры", ТипЦеныНоменклатуры); 
	Отбор.Вставить("Номенклатура", СсылкаНоменклатура);
	ЗначениеРесурсов = РегистрыСведений.УстановкаЦен.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат ЗначениеРесурсов.Цена;
	
КонецФункции
