
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОплатыЗаказов.Записывать = Истина;
	Движение = Движения.ОплатыЗаказов.ДобавитьПриход();
	Движение.Контрагент = Контрагент;
	Движение.Заказ = Заказ;
	Движение.Сумма = - СуммаИтого;
	Движение.Период = Дата; 	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Период = Дата;
		
		Движение = Движения.СтоимостьТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = 	ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Количество * УправлениеЦеами.АктуальнаяЦенаЗакупка(Дата, ТекСтрокаТовары.Номенклатура);
	КонецЦикла;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаИтого = Товары.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтгрузкаТовара") Тогда
		// Заполнение шапки
		Заказ = ДанныеЗаполнения.Заказ;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОтгрузки = ДанныеЗаполнения.Ссылка;
		СуммаИтого = ДанныеЗаполнения.СуммаИтого;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.ЦенаПрихода = УправлениеЦеами.АктуальнаяЦенаЗакупка(ТекущаяДата(), ТекСтрокаТовары.Номенклатура);			
			НоваяСтрока.СуммаПрихода = НоваяСтрока.ЦенаПрихода * ТекСтрокаТовары.Количество; 
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

