
&НаСервере
Процедура СгруппироватьТЧНаСервере()
	ТЗ = Объект.Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество");
	Объект.Товары.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьТЧ(Команда)        
	СгруппироватьТЧНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	СтрокаТЧ.Цена = УправлениеЦеами.АктуальнаяЦенаРозница(Объект.Дата, СтрокаТЧ.Номенклатура);
	РассчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСумму(Стр)
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры
