
Функция ВыполнитьОбмен(Данные)
	ОтветКлиенту = ЗарегестрироватьВыгрузку(Данные.Получить());
	Возврат Новый ХранилищеЗначения(ОтветКлиенту, Новый СжатиеДанных(9));
КонецФункции

Функция ЗарегестрироватьВыгрузку(КодУзла)
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку();
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	Узел = ПланыОбмена.ПланОбмена.НайтиПоКоду(КодУзла); 
	
	Если НЕ (Узел.ЭтотУзел = Истина Или Узел.Пустая()) Тогда 
		ЗаписьСообщения.НачатьЗапись(ЗаписьХМЛ, Узел);
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,ЗаписьСообщения.НомерСообщения); 
		
		Пока ВыборкаИзменений.Следующий() Цикл
			ОбъектОбмена = ВыборкаИзменений.Получить();
			ЗаписатьXML(ЗаписьХМЛ,ОбъектОбмена);
		КонецЦикла;
		
	КонецЕсли;
	ЗаписьСообщения.ЗакончитьЗапись();
	
	Возврат ЗаписьХМЛ.Закрыть();
КонецФункции
