
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОплатыЗаказов.Записывать = Истина;
	Движение = Движения.ОплатыЗаказов.ДобавитьПриход();
	Движение.Контрагент = Контрагент;
	Движение.Заказ = Заказ;
	Движение.Сумма = СуммаИтого;
	Движение.Период = Дата; 	
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура,
	|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	Документ.ОтгрузкаТовара.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧ.Номенклатура,
	|	ДокТЧ.Количество
	|ИЗ
	|	ДокТЧ КАК ДокТЧ";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	
	Движения.Записать();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровОстатки.Номенклатура,
	|	ОстаткиТоваровОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки(
	|			&МоментВремени,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ДокТЧ.Номенклатура
	|					ИЗ
	|						ДокТЧ КАК ДокТЧ)) КАК ОстаткиТоваровОстатки
	|ГДЕ
	|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить("Мало товара " + Выборка.Номенклатура + ", нужно еще " + (-Выборка.КоличествоОстаток));
		КонецЦикла;  
	КонецЕсли; 	
	//====================================================================================================================== 	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СтоимостьТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();  
	
	Движения.СтоимостьТоваров.БлокироватьДляИзменения = Истина;
	
	//Если Режим = РежимПроведенияДокумента.Оперативный Тогда
	Движения.СтоимостьТоваров.Записать();
	//КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьТоваровОстатки.Номенклатура,
	|	СтоимостьТоваровОстатки.Партия,
	|	СтоимостьТоваровОстатки.КоличествоОстаток,
	|	СтоимостьТоваровОстатки.СтоимостьОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.СтоимостьТоваров.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ДокТЧ.Номенклатура
	|				ИЗ
	|					ДокТЧ КАК ДокТЧ)) КАК СтоимостьТоваровОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧ.Номенклатура КАК Номенклатура,
	|	ДокТЧ.Количество КАК Количество,
	|	Остатки.Партия,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	Остатки.СтоимостьОстаток
	|ИЗ
	|	ДокТЧ КАК ДокТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ДокТЧ.Номенклатура = Остатки.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.Партия.МоментВремени //FIFO
	|ИТОГИ
	|	МИНИМУМ(Количество),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени() ); 
	Результат = Запрос.Выполнить();
	ВыборкаТовар = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовар.Следующий() Цикл
		Если ВыборкаТовар.КоличествоОстаток < ВыборкаТовар.Количество Тогда
			Сообщить("Что-то пошло не так, остаток стоимости товаров не совпадает с остатками по складу");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
		ВыборкаПартия = ВыборкаТовар.Выбрать();
		
		ОсталосьСписать = ВыборкаТовар.Количество;
		
		Пока ВыборкаПартия.Следующий() И ОсталосьСписать <> 0 Цикл
			
			Списать = МИН(ОсталосьСписать, ВыборкаПартия.КоличествоОстаток);
			
			Себестоимость = Списать / ВыборкаПартия.КоличествоОстаток * ВыборкаПартия.СтоимостьОстаток;
			
			Движение = Движения.СтоимостьТоваров.ДобавитьРасход();
			Движение.Период = Дата; 
			Движение.Номенклатура = ВыборкаПартия.Номенклатура;
			Движение.Партия = ВыборкаПартия.Партия;
			Движение.Количество = Списать;
			Движение.Стоимость = Себестоимость;
			
			ОсталосьСписать = ОсталосьСписать - Списать;
		КонецЦикла; 
	КонецЦикла;  
	
	Движения.СтоимостьТоваров.Записывать = Истина;
	
	// регистр РезервыТоваров Расход
	Движения.РезервыТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.РезервыТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент;
		Движение.ДатаОкончанияРезерва = Дата;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаИтого = Товары.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заказ") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Склад = ДанныеЗаполнения.Склад;
		Заказ = ДанныеЗаполнения;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



